Revit 2026 API

# EffectInstance Properties

---

The EffectInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace